// Створіть програму, яка визначає вартість квитка до технопарку.
//
//     Користувач вводить:
//     1. свій вік;
// 2. день: 1 — будній, 2 — вихідний.
//
//     Базова ціна квитка:
//     - будній день — 200 грн;
// - вихідний день — 250 грн.
//
//     Знижка за віком:
//     - до 7 років включно — безкоштовно;
// - від 8 до 17 років включно — знижка 50%;
// - від 18 до 59 років включно — повна вартість;
// - від 60 років — знижка 40%.
//
// Програма повинна:
//     - перевірити вік;
// - визначити базову вартість за днем;
// - застосувати потрібну знижку;
// - вивести підсумкову вартість.
//
//     Якщо введено неправильний номер дня — вивести повідомлення:
//     "Помилка: неправильний тип дня".
//
//         Приклади:
// Вік: 16
// День: 1
// Результат: 100 грн
//
// Вік: 65
// День: 2
// Результат: 150


let age = Number(prompt("Введіть ваш вік:"));
let day = Number(prompt("Введіть день (1 — будній, 2 — вихідний):"));

let price;

if (day === 1) {
    price = 200;
} else if (day === 2) {
    price = 250;
} else {
    alert("Помилка: неправильний тип дня");
}

if (day === 1 || day === 2) {
    if (age <= 7) {
        price = 0;
    } else if (age <= 17) {
        price = price * 0.5;
    } else if (age <= 59) {
        price = price;
    } else {
        price = price * 0.6;
    }

    alert("Вартість квитка: " + price + " грн");
}
