// Правильний PIN-код:
// 2026
//
// Користувач має максимум 3 спроби.
//
//     Програма повинна:
//     - запитувати PIN-код;
// - якщо код правильний — вивести "Доступ дозволено" і завершити цикл;
// - якщо код неправильний — повідомити, скільки спроб залишилося;
// - після третьої невдалої спроби вивести "Доступ заблоковано".
//
//     Використайте цикл while АБО do...while.
// Для дострокового завершення після правильного PIN-коду використайте break.
//
// Приклад:
//     PIN: 1111
// Залишилося спроб: 2
//
// PIN: 2026
// Доступ дозволено

let attempts = 0;
let access = false;

while (attempts < 3) {
    let pin = Number(prompt("Введіть PIN-код:"));

    attempts = attempts + 1;

    if (pin === 2026) {
        alert("Доступ дозволено");
        access = true;
        break;
    } else {
        let left = 3 - attempts;

        if (left > 0) {
            alert("Залишилося спроб: " + left);
        }
    }
}

if (access === false) {
    alert("Доступ заблоковано");
}
