// Користувач вводить кількість учнів N.
//     Після цього програма N разів запитує оцінку від 1 до 12.
//
// Потрібно визначити:
//     - суму всіх оцінок;
// - середню оцінку;
// - кількість оцінок 7 і вище;
// - кількість оцінок нижче 7;
// - найбільшу оцінку.
//
//     Використайте цикл for.
//
// У кінці програма повинна вивести зрозумілий звіт.
//
//     Приклад:
// Кількість учнів: 5
// Оцінки: 8, 6, 10, 4, 12
//
// Результат:
//     Сума: 40
// Середня: 8
// Оцінок 7 і вище: 3
// Оцінок нижче 7: 2
// Найбільша оцінка: 12

let n = Number(prompt("Введіть кількість учнів:"));

let sum = 0;
let countGood = 0;
let countBad = 0;
let max = 0;

for (let i = 1; i <= n; i++) {
    let grade = Number(prompt("Введіть оцінку " + i + " від 1 до 12:"));

    sum = sum + grade;

    if (grade >= 7) {
        countGood = countGood + 1;
    } else {
        countBad = countBad + 1;
    }

    if (grade > max) {
        max = grade;
    }
}

let average = sum / n;

alert("Сума: " + sum);
alert("Середня: " + average);
alert("Оцінок 7 і вище: " + countGood);
alert("Оцінок нижче 7: " + countBad);
alert("Найбільша оцінка: " + max);
